Document:[clickhere](https://tinyurl.com/python-pandas-day12
)

In [20]:
import pandas as pd
s1=pd.Series([1,2,3,4,5,6,7,8,9])
s2=pd.Series([12.3,34.3,45.2,12.4,21.5,23.6,21.2,12.3,23.11,34.8])
s3=pd.Series(['a','b','c','d','e','f','g','h','i','j'])
data ={"studentno":s1,"marks":s2,"grades":s3}
df=pd.DataFrame(data)
df

   studentno  marks grades
0        1.0  12.30      a
1        2.0  34.30      b
2        3.0  45.20      c
3        4.0  12.40      d
4        5.0  21.50      e
5        6.0  23.60      f
6        7.0  21.20      g
7        8.0  12.30      h
8        9.0  23.11      i
9        NaN  34.80      j

In [21]:
df.rename(columns={"studentno":"column1","marks":"column2"},inplace=True)
df

   column1  column2 grades
0      1.0    12.30      a
1      2.0    34.30      b
2      3.0    45.20      c
3      4.0    12.40      d
4      5.0    21.50      e
5      6.0    23.60      f
6      7.0    21.20      g
7      8.0    12.30      h
8      9.0    23.11      i
9      NaN    34.80      j

### changing the row index:
1. set_index()
2. reset_index()

In [22]:
df = df.set_index('column2')
df

         column1 grades
column2
12.30        1.0      a
34.30        2.0      b
45.20        3.0      c
12.40        4.0      d
21.50        5.0      e
23.60        6.0      f
21.20        7.0      g
12.30        8.0      h
23.11        9.0      i
34.80        NaN      j

In [23]:
df = df.reset_index()
df

   column2  column1 grades
0    12.30      1.0      a
1    34.30      2.0      b
2    45.20      3.0      c
3    12.40      4.0      d
4    21.50      5.0      e
5    23.60      6.0      f
6    21.20      7.0      g
7    12.30      8.0      h
8    23.11      9.0      i
9    34.80      NaN      j

In [ ]:
label = list("abcdefghij")
label

In [ ]:
df = df.set_index([pd.Index(label)])
df

### Removing single or multiple columns:

In [ ]:
import pandas as pd
import numpy as np
s1=pd.Series([9,11,1,3,4,5,6,2,9])
s2=pd.Series([1.1,3.5,4.7,5.8,2.9,9.3,1.4,2.9,6.4])
s3=pd.Series(['a','b','c','d','e','f','g','h','i'])
data ={"first":s1,"second":s2,"third":s3}
df=pd.DataFrame(data)
df

In [ ]:
#single column removing
#df.drop(["first"],axis=1)
df.drop(columns = ['first'])

In [ ]:
df.drop(columns = ["first","second"])

In [ ]:
df.drop(df.columns[[0,2]],axis=1)

### Working with CSV files:

In [ ]:
df1=pd.read_csv("diamonds.csv",index_col=0)
df1

In [ ]:

df2 = pd.read_csv("https://raw.githubusercontent.com/sumathi16/Datasets/master/diamonds.csv",index_col=0)

In [ ]:
df2

In [ ]:
df1.shape

In [ ]:
df1=pd.read_csv("diamonds.csv",index_col=0,nrows=10)
df1

In [ ]:
df1.shape

In [ ]:
pd.isnull(df1)

In [ ]:
pd.notnull(df1)

In [ ]:
#remove columns with empty cells
df1.dropna(axis=1)